package lr4;

//Напишите программу, которая выводит в консольное окно
//прямоугольный треугольник;
public class Task2 {
    public static void main(String[] args) {
        var l = 10;
        for (int i = 1; i <= l; i++) {
            System.out.println("█".repeat(i));
        }
    }
}
